/*
 *  TOPPERS/JSP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Just Standard Profile Kernel
 * 
 *  Copyright (C) 2000-2003 by Embedded and Real-Time Systems Laboratory
 *                              Toyohashi Univ. of Technology, JAPAN
 *  Copyright (C) 2003      by Advanced Data Controls, Corp
 *  Copyright (C) 2004 by Embedded and Real-Time Systems Laboratory
 *              Graduate School of Information Science, Nagoya Univ., JAPAN    
 * 
 *  ï¿½Ã£â€¹Lâ€™Ëœï¿½Ã¬Å’Â Å½Ã’â€šÃ�ï¿½CË†Ãˆâ€°Âºâ€šÃŒ (1)ï¿½`(4) â€šÃŒï¿½Ã°Å’ï¿½â€šÂ©ï¿½CFree Software Foundation 
 *  â€šÃ‰â€šÃ¦â€šÃ�â€šÃ„Å’Ã¶â€¢\â€šÂ³â€šÃªâ€šÃ„â€šÂ¢â€šÃ© GNU General Public License â€šÃŒ Version 2 â€šÃ‰â€¹L
 *  ï¿½qâ€šÂ³â€šÃªâ€šÃ„â€šÂ¢â€šÃ©ï¿½Ã°Å’ï¿½â€šÃ°â€“Å¾â€šÂ½â€šÂ·ï¿½Ãªï¿½â€¡â€šÃ‰Å’Ã€â€šÃ¨ï¿½Câ€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aï¿½iâ€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’A
 *  â€šÃ°â€°Ã¼â€¢Ã�â€šÂµâ€šÂ½â€šÃ â€šÃŒâ€šÃ°Å Ãœâ€šÃžï¿½DË†Ãˆâ€°Âºâ€œÂ¯â€šÂ¶ï¿½jâ€šÃ°Å½gâ€”pï¿½Eâ€¢Â¡ï¿½Â»ï¿½Eâ€°Ã¼â€¢Ã�ï¿½Eï¿½Ã„â€�zâ€¢zï¿½iË†Ãˆâ€°Âºï¿½C
 *  â€”Ëœâ€”pâ€šÃ†Å’Ã„â€šÃ”ï¿½jâ€šÂ·â€šÃ©â€šÂ±â€šÃ†â€šÃ°â€“Â³ï¿½Å¾â€šÃ…â€¹â€“â€˜Ã¸â€šÂ·â€šÃ©ï¿½D
 *  (1) â€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃ°Æ’\ï¿½[Æ’XÆ’Rï¿½[Æ’hâ€šÃŒÅ’`â€šÃ…â€”Ëœâ€”pâ€šÂ·â€šÃ©ï¿½Ãªï¿½â€¡â€šÃ‰â€šÃ�ï¿½Cï¿½Ã£â€¹Lâ€šÃŒâ€™Ëœï¿½Ã¬
 *      Å’Â â€¢\Å½Â¦ï¿½Câ€šÂ±â€šÃŒâ€”Ëœâ€”pï¿½Ã°Å’ï¿½â€šÂ¨â€šÃ¦â€šÃ‘â€°Âºâ€¹Lâ€šÃŒâ€“Â³â€¢Ã›ï¿½Ã˜â€¹Kâ€™Ã¨â€šÂªï¿½Câ€šÂ»â€šÃŒâ€šÃœâ€šÃœâ€šÃŒÅ’`â€šÃ…Æ’\ï¿½[
 *      Æ’XÆ’Rï¿½[Æ’hâ€™â€ â€šÃ‰Å Ãœâ€šÃœâ€šÃªâ€šÃ„â€šÂ¢â€šÃ©â€šÂ±â€šÃ†ï¿½D
 *  (2) â€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃ°ï¿½CÆ’â€°Æ’CÆ’uÆ’â€°Æ’Å Å’`Å½Â®â€šÃˆâ€šÃ‡ï¿½Câ€˜Â¼â€šÃŒÆ’\Æ’tÆ’gÆ’EÆ’FÆ’AÅ Jâ€�Â­â€šÃ‰Å½g
 *      â€”pâ€šÃ…â€šÂ«â€šÃ©Å’`â€šÃ…ï¿½Ã„â€�zâ€¢zâ€šÂ·â€šÃ©ï¿½Ãªï¿½â€¡â€šÃ‰â€šÃ�ï¿½Cï¿½Ã„â€�zâ€¢zâ€šÃ‰â€�Âºâ€šÂ¤Æ’hÆ’LÆ’â€¦Æ’ï¿½Æ’â€œÆ’gï¿½iâ€”Ëœâ€”p
 *      Å½Ã’Æ’}Æ’jÆ’â€¦Æ’AÆ’â€¹â€šÃˆâ€šÃ‡ï¿½jâ€šÃ‰ï¿½Cï¿½Ã£â€¹Lâ€šÃŒâ€™Ëœï¿½Ã¬Å’Â â€¢\Å½Â¦ï¿½Câ€šÂ±â€šÃŒâ€”Ëœâ€”pï¿½Ã°Å’ï¿½â€šÂ¨â€šÃ¦â€šÃ‘â€°Âºâ€¹L
 *      â€šÃŒâ€“Â³â€¢Ã›ï¿½Ã˜â€¹Kâ€™Ã¨â€šÃ°Å’fï¿½Ãšâ€šÂ·â€šÃ©â€šÂ±â€šÃ†ï¿½D
 *  (3) â€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃ°ï¿½Câ€¹@Å Ã­â€šÃ‰â€˜gâ€šÃ�ï¿½Å¾â€šÃžâ€šÃˆâ€šÃ‡ï¿½Câ€˜Â¼â€šÃŒÆ’\Æ’tÆ’gÆ’EÆ’FÆ’AÅ Jâ€�Â­â€šÃ‰Å½g
 *      â€”pâ€šÃ…â€šÂ«â€šÃˆâ€šÂ¢Å’`â€šÃ…ï¿½Ã„â€�zâ€¢zâ€šÂ·â€šÃ©ï¿½Ãªï¿½â€¡â€šÃ‰â€šÃ�ï¿½CÅ½Å¸â€šÃŒâ€šÂ¢â€šÂ¸â€šÃªâ€šÂ©â€šÃŒï¿½Ã°Å’ï¿½â€šÃ°â€“Å¾â€šÂ½â€šÂ·â€šÂ±
 *      â€šÃ†ï¿½D
 *    (a) ï¿½Ã„â€�zâ€¢zâ€šÃ‰â€�Âºâ€šÂ¤Æ’hÆ’LÆ’â€¦Æ’ï¿½Æ’â€œÆ’gï¿½iâ€”Ëœâ€”pÅ½Ã’Æ’}Æ’jÆ’â€¦Æ’AÆ’â€¹â€šÃˆâ€šÃ‡ï¿½jâ€šÃ‰ï¿½Cï¿½Ã£â€¹Lâ€šÃŒâ€™Ëœ
 *        ï¿½Ã¬Å’Â â€¢\Å½Â¦ï¿½Câ€šÂ±â€šÃŒâ€”Ëœâ€”pï¿½Ã°Å’ï¿½â€šÂ¨â€šÃ¦â€šÃ‘â€°Âºâ€¹Lâ€šÃŒâ€“Â³â€¢Ã›ï¿½Ã˜â€¹Kâ€™Ã¨â€šÃ°Å’fï¿½Ãšâ€šÂ·â€šÃ©â€šÂ±â€šÃ†ï¿½D
 *    (b) ï¿½Ã„â€�zâ€¢zâ€šÃŒÅ’`â€˜Ã”â€šÃ°ï¿½Câ€¢ÃŠâ€šÃ‰â€™Ã¨â€šÃŸâ€šÃ©â€¢Ã»â€“@â€šÃ‰â€šÃ¦â€šÃ�â€šÃ„ï¿½CTOPPERSÆ’vÆ’ï¿½Æ’WÆ’FÆ’NÆ’gâ€šÃ‰
 *        â€¢Ã±ï¿½ï¿½â€šÂ·â€šÃ©â€šÂ±â€šÃ†ï¿½D
 *  (4) â€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃŒâ€”Ëœâ€”pâ€šÃ‰â€šÃ¦â€šÃ¨â€™Â¼ï¿½Ãšâ€œIâ€šÃœâ€šÂ½â€šÃ�Å Ã”ï¿½Ãšâ€œIâ€šÃ‰ï¿½Â¶â€šÂ¶â€šÃ©â€šÂ¢â€šÂ©â€šÃˆâ€šÃ©â€˜Â¹
 *      Å Qâ€šÂ©â€šÃ§â€šÃ ï¿½Cï¿½Ã£â€¹Lâ€™Ëœï¿½Ã¬Å’Â Å½Ã’â€šÂ¨â€šÃ¦â€šÃ‘TOPPERSÆ’vÆ’ï¿½Æ’WÆ’FÆ’NÆ’gâ€šÃ°â€“Ã†ï¿½Ã“â€šÂ·â€šÃ©â€šÂ±â€šÃ†ï¿½D
 * 
 *  â€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃ�ï¿½Câ€“Â³â€¢Ã›ï¿½Ã˜â€šÃ…â€™Ã±â€¹Å¸â€šÂ³â€šÃªâ€šÃ„â€šÂ¢â€šÃ©â€šÃ â€šÃŒâ€šÃ…â€šÂ â€šÃ©ï¿½Dï¿½Ã£â€¹Lâ€™Ëœï¿½Ã¬Å’Â Å½Ã’â€šÂ¨
 *  â€šÃ¦â€šÃ‘TOPPERSÆ’vÆ’ï¿½Æ’WÆ’FÆ’NÆ’gâ€šÃ�ï¿½Câ€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃ‰Å Ã–â€šÂµâ€šÃ„ï¿½Câ€šÂ»â€šÃŒâ€œKâ€”pâ€°Ã‚â€�\ï¿½Â«â€šÃ 
 *  Å Ãœâ€šÃŸâ€šÃ„ï¿½Câ€šÂ¢â€šÂ©â€šÃˆâ€šÃ©â€¢Ã›ï¿½Ã˜â€šÃ ï¿½sâ€šÃ­â€šÃˆâ€šÂ¢ï¿½Dâ€šÃœâ€šÂ½ï¿½Câ€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃŒâ€”Ëœâ€”pâ€šÃ‰â€šÃ¦â€šÃ¨â€™Â¼
 *  ï¿½Ãšâ€œIâ€šÃœâ€šÂ½â€šÃ�Å Ã”ï¿½Ãšâ€œIâ€šÃ‰ï¿½Â¶â€šÂ¶â€šÂ½â€šÂ¢â€šÂ©â€šÃˆâ€šÃ©â€˜Â¹Å Qâ€šÃ‰Å Ã–â€šÂµâ€šÃ„â€šÃ ï¿½Câ€šÂ»â€šÃŒï¿½Ã“â€�Câ€šÃ°â€¢â€°â€šÃ­â€šÃˆâ€šÂ¢ï¿½D
 * 
 *  @(#) $Id: hw_serial.h,v 1.2 2004/05/27 07:32:22 honda Exp $
 */

/*
 *  Æ’VÆ’Å Æ’AÆ’â€¹I/OÆ’fÆ’oÆ’CÆ’Xï¿½iSIOï¿½jÆ’hÆ’â€°Æ’CÆ’oï¿½iIntegratorâ€”pï¿½j
 */

#ifndef _HW_SERIAL_H_
#define _HW_SERIAL_H_

#include "integrator.h"

/*
 *  Æ’VÆ’Å Æ’AÆ’â€¹I/Oâ€šÃŒÅ â€žï¿½Å¾â€šÃ�Æ’nÆ’â€œÆ’hÆ’â€°â€šÃŒÆ’xÆ’NÆ’^â€�Ã”ï¿½â€ 
 */
//#define INHNO_SIO  IRQ_UART1_BIT
//#define INHNO_SIO2 IRQ_UART0_BIT

/*
 *  SIOÆ’hÆ’â€°Æ’CÆ’oâ€šÃŒï¿½â€°Å Ãºâ€°Â»Æ’â€¹ï¿½[Æ’`Æ’â€œ
 */
#define sio_initialize  uart_initialize

#ifndef _MACRO_ONLY

/*
 *  Æ’VÆ’Å Æ’AÆ’â€¹I/OÆ’|ï¿½[Æ’gâ€šÃŒÆ’Iï¿½[Æ’vÆ’â€œ
 */
Inline SIOPCB *
sio_opn_por(ID siopid, VP_INT exinf)
{
    SIOPCB  *siopcb;
    BOOL    openflag;

    /*
     *  Æ’Iï¿½[Æ’vÆ’â€œâ€šÂµâ€šÂ½Æ’|ï¿½[Æ’gâ€šÂªâ€šÂ â€šÃ©â€šÂ©â€šÃ° openflg â€šÃ‰â€œÃ‡â€šÃ±â€šÃ…â€šÂ¨â€šÂ­ï¿½D
     */
    openflag = uart_openflag();
    
    /*
     *  Æ’fÆ’oÆ’CÆ’XË†Ã‹â€˜Â¶â€šÃŒÆ’Iï¿½[Æ’vÆ’â€œï¿½Ë†â€”ï¿½ï¿½D
     */
    siopcb = uart_opn_por(siopid, exinf);
      
    /*
     * Å â€žï¿½Å¾â€šÃ�Å Ã–ËœAâ€šÃŒï¿½Ã�â€™Ã¨
     */
    /* Enable Interrupt Rx */
    if(!openflag){
        //sil_wrw_mem((VP)IRQ0_ENABLESET,IRQ_UART1);
    }
    
    return(siopcb);
}

/*
 *  Æ’VÆ’Å Æ’AÆ’â€¹I/OÆ’|ï¿½[Æ’gâ€šÃŒÆ’NÆ’ï¿½ï¿½[Æ’Y
 */
Inline void
sio_cls_por(SIOPCB *siopcb)
{
    /*
     *  Æ’fÆ’oÆ’CÆ’XË†Ã‹â€˜Â¶â€šÃŒÆ’NÆ’ï¿½ï¿½[Æ’Yï¿½Ë†â€”ï¿½ï¿½D
     */
    uart_cls_por(siopcb);

    /*
     *  Æ’VÆ’Å Æ’AÆ’â€¹I/OÅ â€žï¿½Å¾â€šÃ�â€šÃ°Æ’}Æ’XÆ’Nâ€šÂ·â€šÃ©ï¿½D
     */
    if (!uart_openflag) {
        /* Clear Rx Tx Pending bit */
        //sil_wrw_mem((VP)IRQ0_ENABLECLR,(IRQ_UART1));
    }
}


/*
 *  SIOâ€šÃŒÅ â€žï¿½Å¾â€šÃ�Æ’nÆ’â€œÆ’hÆ’â€°
 */
#define sio_handler  uart_isr

/*
 *  Æ’VÆ’Å Æ’AÆ’â€¹I/OÆ’|ï¿½[Æ’gâ€šÃ–â€šÃŒâ€¢Â¶Å½Å¡â€˜â€”ï¿½M
 */
#define sio_snd_chr uart_snd_chr

/*
 *  Æ’VÆ’Å Æ’AÆ’â€¹I/OÆ’|ï¿½[Æ’gâ€šÂ©â€šÃ§â€šÃŒâ€¢Â¶Å½Å¡Å½Ã³ï¿½M
 */
#define sio_rcv_chr uart_rcv_chr

/*
 *  Æ’VÆ’Å Æ’AÆ’â€¹I/OÆ’|ï¿½[Æ’gâ€šÂ©â€šÃ§â€šÃŒÆ’Rï¿½[Æ’â€¹Æ’oÆ’bÆ’Nâ€šÃŒâ€¹â€“â€°Ã‚
 */
#define sio_ena_cbr uart_ena_cbr

/*
 *  Æ’VÆ’Å Æ’AÆ’â€¹I/OÆ’|ï¿½[Æ’gâ€šÂ©â€šÃ§â€šÃŒÆ’Rï¿½[Æ’â€¹Æ’oÆ’bÆ’Nâ€šÃŒâ€¹Ã–Å½~
 */
#define sio_dis_cbr uart_dis_cbr

/*
 *  Æ’VÆ’Å Æ’AÆ’â€¹I/OÆ’|ï¿½[Æ’gâ€šÂ©â€šÃ§â€šÃŒâ€˜â€”ï¿½Mâ€°Ã‚â€�\Æ’Rï¿½[Æ’â€¹Æ’oÆ’bÆ’N
 */
#define sio_ierdy_snd   uart_ierdy_snd

/*
 *  Æ’VÆ’Å Æ’AÆ’â€¹I/OÆ’|ï¿½[Æ’gâ€šÂ©â€šÃ§â€šÃŒÅ½Ã³ï¿½Mâ€™ÃŠâ€™mÆ’Rï¿½[Æ’â€¹Æ’oÆ’bÆ’N
 */
#define sio_ierdy_rcv   uart_ierdy_rcv

#endif /* _MACRO_ONLY */
#endif /* _HW_SERIAL_H_ */

