/*
 *  TOPPERS/JSP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Just Standard Profile Kernel
 * 
 *  Copyright (C) 2000-2003 by Embedded and Real-Time Systems Laboratory
 *                              Toyohashi Univ. of Technology, JAPAN
 *                2003      by  Advanced Data Controls, Corp
 * 
 *  ï¿½Ã£â€¹Lâ€™Ëœï¿½Ã¬Å’Â Å½Ã’â€šÃ�ï¿½CË†Ãˆâ€°Âºâ€šÃŒ (1)ï¿½`(4) â€šÃŒï¿½Ã°Å’ï¿½â€šÂ©ï¿½CFree Software Foundation 
 *  â€šÃ‰â€šÃ¦â€šÃ�â€šÃ„Å’Ã¶â€¢\â€šÂ³â€šÃªâ€šÃ„â€šÂ¢â€šÃ© GNU General Public License â€šÃŒ Version 2 â€šÃ‰â€¹L
 *  ï¿½qâ€šÂ³â€šÃªâ€šÃ„â€šÂ¢â€šÃ©ï¿½Ã°Å’ï¿½â€šÃ°â€“Å¾â€šÂ½â€šÂ·ï¿½Ãªï¿½â€¡â€šÃ‰Å’Ã€â€šÃ¨ï¿½Câ€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aï¿½iâ€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’A
 *  â€šÃ°â€°Ã¼â€¢Ã�â€šÂµâ€šÂ½â€šÃ â€šÃŒâ€šÃ°Å Ãœâ€šÃžï¿½DË†Ãˆâ€°Âºâ€œÂ¯â€šÂ¶ï¿½jâ€šÃ°Å½gâ€”pï¿½Eâ€¢Â¡ï¿½Â»ï¿½Eâ€°Ã¼â€¢Ã�ï¿½Eï¿½Ã„â€�zâ€¢zï¿½iË†Ãˆâ€°Âºï¿½C
 *  â€”Ëœâ€”pâ€šÃ†Å’Ã„â€šÃ”ï¿½jâ€šÂ·â€šÃ©â€šÂ±â€šÃ†â€šÃ°â€“Â³ï¿½Å¾â€šÃ…â€¹â€“â€˜Ã¸â€šÂ·â€šÃ©ï¿½D
 *  (1) â€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃ°Æ’\ï¿½[Æ’XÆ’Rï¿½[Æ’hâ€šÃŒÅ’`â€šÃ…â€”Ëœâ€”pâ€šÂ·â€šÃ©ï¿½Ãªï¿½â€¡â€šÃ‰â€šÃ�ï¿½Cï¿½Ã£â€¹Lâ€šÃŒâ€™Ëœï¿½Ã¬
 *      Å’Â â€¢\Å½Â¦ï¿½Câ€šÂ±â€šÃŒâ€”Ëœâ€”pï¿½Ã°Å’ï¿½â€šÂ¨â€šÃ¦â€šÃ‘â€°Âºâ€¹Lâ€šÃŒâ€“Â³â€¢Ã›ï¿½Ã˜â€¹Kâ€™Ã¨â€šÂªï¿½Câ€šÂ»â€šÃŒâ€šÃœâ€šÃœâ€šÃŒÅ’`â€šÃ…Æ’\ï¿½[
 *      Æ’XÆ’Rï¿½[Æ’hâ€™â€ â€šÃ‰Å Ãœâ€šÃœâ€šÃªâ€šÃ„â€šÂ¢â€šÃ©â€šÂ±â€šÃ†ï¿½D
 *  (2) â€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃ°ï¿½CÆ’â€°Æ’CÆ’uÆ’â€°Æ’Å Å’`Å½Â®â€šÃˆâ€šÃ‡ï¿½Câ€˜Â¼â€šÃŒÆ’\Æ’tÆ’gÆ’EÆ’FÆ’AÅ Jâ€�Â­â€šÃ‰Å½g
 *      â€”pâ€šÃ…â€šÂ«â€šÃ©Å’`â€šÃ…ï¿½Ã„â€�zâ€¢zâ€šÂ·â€šÃ©ï¿½Ãªï¿½â€¡â€šÃ‰â€šÃ�ï¿½Cï¿½Ã„â€�zâ€¢zâ€šÃ‰â€�Âºâ€šÂ¤Æ’hÆ’LÆ’â€¦Æ’ï¿½Æ’â€œÆ’gï¿½iâ€”Ëœâ€”p
 *      Å½Ã’Æ’}Æ’jÆ’â€¦Æ’AÆ’â€¹â€šÃˆâ€šÃ‡ï¿½jâ€šÃ‰ï¿½Cï¿½Ã£â€¹Lâ€šÃŒâ€™Ëœï¿½Ã¬Å’Â â€¢\Å½Â¦ï¿½Câ€šÂ±â€šÃŒâ€”Ëœâ€”pï¿½Ã°Å’ï¿½â€šÂ¨â€šÃ¦â€šÃ‘â€°Âºâ€¹L
 *      â€šÃŒâ€“Â³â€¢Ã›ï¿½Ã˜â€¹Kâ€™Ã¨â€šÃ°Å’fï¿½Ãšâ€šÂ·â€šÃ©â€šÂ±â€šÃ†ï¿½D
 *  (3) â€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃ°ï¿½Câ€¹@Å Ã­â€šÃ‰â€˜gâ€šÃ�ï¿½Å¾â€šÃžâ€šÃˆâ€šÃ‡ï¿½Câ€˜Â¼â€šÃŒÆ’\Æ’tÆ’gÆ’EÆ’FÆ’AÅ Jâ€�Â­â€šÃ‰Å½g
 *      â€”pâ€šÃ…â€šÂ«â€šÃˆâ€šÂ¢Å’`â€šÃ…ï¿½Ã„â€�zâ€¢zâ€šÂ·â€šÃ©ï¿½Ãªï¿½â€¡â€šÃ‰â€šÃ�ï¿½CÅ½Å¸â€šÃŒâ€šÂ¢â€šÂ¸â€šÃªâ€šÂ©â€šÃŒï¿½Ã°Å’ï¿½â€šÃ°â€“Å¾â€šÂ½â€šÂ·â€šÂ±
 *      â€šÃ†ï¿½D
 *    (a) ï¿½Ã„â€�zâ€¢zâ€šÃ‰â€�Âºâ€šÂ¤Æ’hÆ’LÆ’â€¦Æ’ï¿½Æ’â€œÆ’gï¿½iâ€”Ëœâ€”pÅ½Ã’Æ’}Æ’jÆ’â€¦Æ’AÆ’â€¹â€šÃˆâ€šÃ‡ï¿½jâ€šÃ‰ï¿½Cï¿½Ã£â€¹Lâ€šÃŒâ€™Ëœ
 *        ï¿½Ã¬Å’Â â€¢\Å½Â¦ï¿½Câ€šÂ±â€šÃŒâ€”Ëœâ€”pï¿½Ã°Å’ï¿½â€šÂ¨â€šÃ¦â€šÃ‘â€°Âºâ€¹Lâ€šÃŒâ€“Â³â€¢Ã›ï¿½Ã˜â€¹Kâ€™Ã¨â€šÃ°Å’fï¿½Ãšâ€šÂ·â€šÃ©â€šÂ±â€šÃ†ï¿½D
 *    (b) ï¿½Ã„â€�zâ€¢zâ€šÃŒÅ’`â€˜Ã”â€šÃ°ï¿½Câ€¢ÃŠâ€šÃ‰â€™Ã¨â€šÃŸâ€šÃ©â€¢Ã»â€“@â€šÃ‰â€šÃ¦â€šÃ�â€šÃ„ï¿½CTOPPERSÆ’vÆ’ï¿½Æ’WÆ’FÆ’NÆ’gâ€šÃ‰
 *        â€¢Ã±ï¿½ï¿½â€šÂ·â€šÃ©â€šÂ±â€šÃ†ï¿½D
 *  (4) â€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃŒâ€”Ëœâ€”pâ€šÃ‰â€šÃ¦â€šÃ¨â€™Â¼ï¿½Ãšâ€œIâ€šÃœâ€šÂ½â€šÃ�Å Ã”ï¿½Ãšâ€œIâ€šÃ‰ï¿½Â¶â€šÂ¶â€šÃ©â€šÂ¢â€šÂ©â€šÃˆâ€šÃ©â€˜Â¹
 *      Å Qâ€šÂ©â€šÃ§â€šÃ ï¿½Cï¿½Ã£â€¹Lâ€™Ëœï¿½Ã¬Å’Â Å½Ã’â€šÂ¨â€šÃ¦â€šÃ‘TOPPERSÆ’vÆ’ï¿½Æ’WÆ’FÆ’NÆ’gâ€šÃ°â€“Ã†ï¿½Ã“â€šÂ·â€šÃ©â€šÂ±â€šÃ†ï¿½D
 * 
 *  â€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃ�ï¿½Câ€“Â³â€¢Ã›ï¿½Ã˜â€šÃ…â€™Ã±â€¹Å¸â€šÂ³â€šÃªâ€šÃ„â€šÂ¢â€šÃ©â€šÃ â€šÃŒâ€šÃ…â€šÂ â€šÃ©ï¿½Dï¿½Ã£â€¹Lâ€™Ëœï¿½Ã¬Å’Â Å½Ã’â€šÂ¨
 *  â€šÃ¦â€šÃ‘TOPPERSÆ’vÆ’ï¿½Æ’WÆ’FÆ’NÆ’gâ€šÃ�ï¿½Câ€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃ‰Å Ã–â€šÂµâ€šÃ„ï¿½Câ€šÂ»â€šÃŒâ€œKâ€”pâ€°Ã‚â€�\ï¿½Â«â€šÃ 
 *  Å Ãœâ€šÃŸâ€šÃ„ï¿½Câ€šÂ¢â€šÂ©â€šÃˆâ€šÃ©â€¢Ã›ï¿½Ã˜â€šÃ ï¿½sâ€šÃ­â€šÃˆâ€šÂ¢ï¿½Dâ€šÃœâ€šÂ½ï¿½Câ€“{Æ’\Æ’tÆ’gÆ’EÆ’FÆ’Aâ€šÃŒâ€”Ëœâ€”pâ€šÃ‰â€šÃ¦â€šÃ¨â€™Â¼
 *  ï¿½Ãšâ€œIâ€šÃœâ€šÂ½â€šÃ�Å Ã”ï¿½Ãšâ€œIâ€šÃ‰ï¿½Â¶â€šÂ¶â€šÂ½â€šÂ¢â€šÂ©â€šÃˆâ€šÃ©â€˜Â¹Å Qâ€šÃ‰Å Ã–â€šÂµâ€šÃ„â€šÃ ï¿½Câ€šÂ»â€šÃŒï¿½Ã“â€�Câ€šÃ°â€¢â€°â€šÃ­â€šÃˆâ€šÂ¢ï¿½D
 * 
 *  @(#) $Id: hw_timer.h,v 1.4 2007/01/05 02:02:38 honda Exp $
 */

/*
 *  CPUË†Ã‹â€˜Â¶Æ’^Æ’CÆ’}Æ’â€šÆ’WÆ’â€¦ï¿½[Æ’â€¹ï¿½iIntegratorâ€”pï¿½j
 *  TIMER1(24MhzÅ’Ã…â€™Ã¨)â€šÃ°Å½gâ€”p
 */

#ifndef _HW_TIMER_H_
#define _HW_TIMER_H_

#include <include/s_services.h>
#include <armv6/KL46/integrator.h>
#include <armv6/KL46/driver/mcg/mcg.h>
#include <armv6/KL46/Project_Headers/derivative.h>

/*
 *  Æ’^Æ’CÆ’}Å â€žï¿½Å¾â€šÃ�â€šÃŒÅ â€žï¿½Å¾â€šÃ�â€�Ã”ï¿½â€ 
 */
#define    INHNO_TIMER    IRQ_TM1_BIT

#ifndef _MACRO_ONLY

/*
 *  Æ’^Æ’CÆ’}â€™lâ€šÃŒâ€œÃ â€¢â€�â€¢\Å’Â»â€šÃŒÅ’^
 */
typedef UW    CLOCK;

/*
 *  Æ’^Æ’CÆ’}â€™lâ€šÃŒâ€œÃ â€¢â€�â€¢\Å’Â»â€šÃ†Æ’~Æ’Å â€¢bï¿½EÆ’ÃŠâ€¢bâ€™PË†ÃŠâ€šÃ†â€šÃŒâ€¢Ã�Å Â·
 *  TIMER_CLOCK â€šÃ�Æ’^ï¿½[Æ’QÆ’bÆ’gÆ’{ï¿½[Æ’hâ€“Ë†â€šÃ‰ï¿½Ã�â€™Ã¨
 */
#define TO_CLOCK(nume, deno) (TIMER_CLOCK * (nume) / (deno))
#define TO_USEC(clock)       ((clock) * 1000 / TIMER_CLOCK)

/*
 *  ï¿½Ã�â€™Ã¨â€šÃ…â€šÂ«â€šÃ©ï¿½Ã…â€˜Ã¥â€šÃŒÆ’^Æ’CÆ’}Å½Ã¼Å Ãºï¿½iâ€™PË†ÃŠâ€šÃ�â€œÃ â€¢â€�â€¢\Å’Â»ï¿½j
 */
#define MAX_CLOCK    ((CLOCK) 0xffffffff)
/*
 *  Æ’^Æ’CÆ’}â€šÃŒÅ’Â»ï¿½Ã�â€™lâ€šÃ°Å â€žï¿½Å¾â€šÃ�â€�Â­ï¿½Â¶â€˜Oâ€šÃŒâ€™lâ€šÃ†â€šÃ�â€šÃˆâ€šÂ·â€šÂ©â€šÃŒâ€�Â»â€™f
 */
#define GET_TOLERANCE    100
#define BEFORE_IREQ(clock) \
        ((clock) >= TO_CLOCK(TIC_NUME, TIC_DENO) - GET_TOLERANCE)

/*
 *  Æ’^Æ’CÆ’}â€šÃŒâ€¹Nâ€œÂ®ï¿½Ë†â€”ï¿½
 *
 *  Æ’^Æ’CÆ’}â€šÃ°ï¿½â€°Å Ãºâ€°Â»â€šÂµï¿½CÅ½Ã¼Å Ãºâ€œIâ€šÃˆÆ’^Æ’CÆ’}Å â€žï¿½Å¾â€šÃ�â€”vâ€¹ï¿½â€šÃ°â€�Â­ï¿½Â¶â€šÂ³â€šÂ¹â€šÃ©ï¿½D
 */
Inline void
hw_timer_initialize()
{
	// PIT module setup
	SIM_SOPT2 |= SIM_SOPT2_PLLFLLSEL_MASK;			// select PLL as source
	CLOCK    cyc = TO_CLOCK(TIC_NUME, TIC_DENO);
	NVIC_ISER = 1<<22;
	SIM_SCGC6 |= SIM_SCGC6_PIT_MASK;
	PIT_MCR &= ~PIT_MCR_MDIS_MASK;					//enable module PIT
	PIT_LDVAL1 |= PIT_LDVAL_TSV(cyc);				//set time1
	PIT_TCTRL1 |= PIT_TCTRL_TIE_MASK;				//enable iter1
	PIT_TCTRL1 |= PIT_TCTRL_TEN_MASK;				//enable timer1
}

extern void timer_handler();

/*
 *  Æ’^Æ’CÆ’}Å â€žï¿½Å¾â€šÃ�â€”vâ€¹ï¿½â€šÃŒÆ’NÆ’Å Æ’A
 */
Inline void
hw_timer_int_clear()
{
	interrupt_count--;
	// clear interrupt flag
	PIT_TFLG1 |= PIT_TFLG_TIF_MASK;
}

/*
 *  Æ’^Æ’CÆ’}â€šÃŒâ€™Ã¢Å½~ï¿½Ë†â€”ï¿½
 */
Inline void
hw_timer_terminate()
{
	NVIC_ICER = 1<<22;
	PIT_TCTRL1 &= ~PIT_TCTRL_TEN_MASK;
}

/*
 *  Æ’^Æ’CÆ’}â€šÃŒÅ’Â»ï¿½Ã�â€™lâ€šÃŒâ€œÃ‡â€šÃ�â€šÂ¾â€šÂµ
 *
 *  Å â€žï¿½Å¾â€šÃ�â€¹Ã–Å½~â€¹Ã¦Å Ã”â€™â€ â€šÃ…Å’Ã„â€šÃ‘ï¿½oâ€šÂ·â€šÂ±â€šÃ†ï¿½D
 */
Inline CLOCK
hw_timer_get_current(void)
{
	return (TO_CLOCK(TIC_NUME, TIC_DENO) - sil_rew_mem((VP)PIT_CVAL1));
}

Inline BOOL
hw_timer_fetch_interrupt(void)
{
    return(sil_rew_mem((VP)PIT_TFLG1) & PIT_TFLG1);
}

#endif /* _MACRO_ONLY */
#endif /* _HW_TIMER_H_ */



